app/Models/NewsModel.php

SELECT *
FROM `news`
SELECT *
FROM `news`
WHERE `slug` = 'elvis-sighted'
 LIMIT 1
---
    public function getNews($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
        }

        return $this->where('slug', $slug)->first();